soapandrest/src/test/resources/delete.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.baeldung.com/springsoap/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:removeSoapByIdRequest>
            <gs:id>1</gs:id>
        </gs:removeSoapByIdRequest>
    </soapenv:Body>
</soapenv:Envelope>